In [1]:
import pandas as pd

In [4]:
a = pd.DataFrame([{'a': 1, 'b': 4}, {'b': -3, 'c': 9}])
a

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [5]:
a.isnull()

       a      b      c
0  False  False   True
1   True  False  False

In [6]:
a.isnull().sum()

a    1
b    0
c    1
dtype: int64

In [7]:
a.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [11]:
a

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [16]:
a.dropna(axis=1)

   b
0  4
1 -3

In [17]:
a.dropna(axis=0)

Empty DataFrame
Columns: [a, b, c]
Index: []

In [20]:
a.fillna(10, inplace=True)
a

      a  b     c
0   1.0  4  10.0
1  10.0 -3   9.0